packages/artillery-plugin-expect/test/pets-fail-test.yaml
config:
  target: http://localhost:9099
  phases:
    - duration: 1
      arrivalCount: 1
  plugins:
    expect:
      reportFailuresAsErrors: true
      useOnlyRequestNames: true
scenarios:
  - flow:
      - get:
          name: "unicorns"
          url: "/pets/2"
          expect:
            - statusCode: 200